app/views/articles/_article.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = $1  [["article_id", 1]]
---
  <p>Description: <%= article.description %></p>
  <p>Tag: <% article.tags.each do |tag| %>