app/views/articles/_form.html.erb

SELECT "tags".* FROM "tags"
SELECT "tags"."id" FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = ?  [["article_id", 4]]
---
  <%= form.label :tag %><br>
  <% Tag.all.each do |tag| %>
    <label>
      <%= check_box_tag "article[tag_ids][]", tag.id, @article&.tag_ids&.include?(tag.id) %>

SELECT "categories".* FROM "categories"
---
    <%= form.label :category %><br />
    <%= form.collection_select :category_id, Category.all, :id, :name %>