app/views/articles/search.html.erb

          <tr>
            <td><% author = User.find_by(id: article.author_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

            </td>
            <td><% category = Category.find_by(id: article.category_id) %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]