app/views/articles/show.html.erb

  <strong>Tags:</strong>
  <% @article.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "articles_tags" ON "tags"."id" = "articles_tags"."tag_id" WHERE "articles_tags"."article_id" = ?  [["article_id", 4]]