app/controllers/articles_controller.rb

  def index
    @articles = Article.where(published: true)
---
SELECT "articles".* FROM "articles" WHERE "articles"."published" = $1  [["published", true]]

  def show
    @comments = @article.comments.order(created_at: :desc).page(params[:page]).per(5)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 2]]

  def create
    @article = current_user.articles.new(article_params)
    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "description", "cover", "tags", "category_id", "author_id", "created_at", "updated_at", "published") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def publish
    @article = Article.find(params[:id])
    @article.update(published: true)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = $1, "published" = $2 WHERE "articles"."id" = $3  [["updated_at", "2023-04-19 07:04:50.815531"], ["published", true], ["id", 3]]

  def hide
    @article = Article.find(params[:id])
    @article.update(published: false)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = $1, "published" = $2 WHERE "articles"."id" = $3  [["updated_at", "2023-04-19 07:04:46.207866"], ["published", false], ["id", 3]]