app/controllers/tags_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Tag1"], ["created_at", "2023-04-18 08:06:51.393519"], ["updated_at", "2023-04-18 08:06:51.393519"]]
---
  def create
    @tag = Tag.new(tag_params)

    if @tag.save