app/jobs/welcome_email_job.rb

SELECT "users".* FROM "users" WHERE "users"."welcome_email_sent_at" IS NULL
UPDATE "users" SET "updated_at" = $1, "welcome_email_sent_at" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-04-18 11:21:39.343895"], ["welcome_email_sent_at", "2023-04-18 11:21:39.342053"], ["id", 1]]
---
  def perform
    users = User.where(welcome_email_sent_at: nil)
    users.each do |user|
      UserMailer.welcome_email(user).deliver_now
      user.update(welcome_email_sent_at: Time.now)